export const mockHorzontalData = {
  title: 'Степень автоматизации основных бизнес-процессов на предприятиях ',
  graphic: [
    {
      name: 'Управление сбытом и логистикой',
      uv: 3.6,
    },
    {
      name: 'Управление производством',
      uv: 3.6,
    },
    {
      name: 'Управление подготовкой производства',
      uv: 3.6,
    },
    {
      name: 'Управление материально-техническим обеспечением',
      uv: 3.6,
    },
    {
      name: 'Управление качеством продукции',
      uv: 3.3,
    },
    {
      name: 'Упаковка и хранение',
      uv: 3.1,
    },
    {
      name: 'Управление маркетинговыми исследованиями',
      uv: 2.7,
    },
    {
      name: 'Управление опытно-конструкторскими работами',
      uv: 2.6,
    },
    {
      name: 'Монтаж, эксплуатация и послепродажное обслуживание',
      uv: 2.4,
    },
  ],
};

export const mockHorzontalDataSecond = {
  title:
    'Уровень использования цифровых технологий в добывающей промышленности Красноярского края (5 позиций, превышающие значения РФ)',
  graphic: [
    {
      name: 'Геоинформационные системы (ГИС)',
      uv: 18.8,
    },
    {
      name: 'Интернет-вещей (IoT)',
      uv: 14.6,
    },
    {
      name: 'RFID',
      uv: 14.0,
    },
    {
      name: 'Аддитивные технологии',
      uv: 15.0,
    },
    {
      name: 'Цифровые двойники',
      uv: 2.1,
    },
  ],
};

export const mockHorzontalDataThrid = {
  title:
    'Структура внутренних затрат предприятий промышленности Красноярского края на цифровые технологии (Внутренние затраты 14,4 млрд. рублей)',
  graphic: [
    {
      name: 'Приобретение машин и оборудования',
      uv: 40.3,
    },
    {
      name: 'Оплата услуг электросвязи',
      uv: 18.8,
    },
    {
      name: 'Приобретение ПО',
      uv: 16.7,
    },
    {
      name: 'Оплата интернета',
      uv: 4.2,
    },
    {
      name: 'Приобретение цифрового контента',
      uv: 0.8,
    },
    {
      name: 'Обучение сотрудников',
      uv: 0.2,
    },
  ],
};

export const mockHorzontalDataFour = {
  title:
    'Фонды федерального уровня: поддержка проектов цифровизации организаций ПК Красноярского края, количество проектов',
  graphic: [
    {
      name: 'Фонд развития промышленности',
      uv: 7,
    },
    {
      name: 'Фонд Сколково',
      uv: 8,
    },
    {
      name: 'Фонд содействия инновациям',
      uv: 23,
    },
  ],
};

export const mockHorzontalDataFive = {
  graphic: [
    {
      name: 'Управление сбытом и логистикой',
      uv: 7,
    },
    {
      name: 'Управление производством',
      uv: 8,
    },
    {
      name: 'Управление подготовкой производства',
      uv: 23,
    },
  ],
  legend: [
    'Машиностроительные предприятия (82,2 млрд. рублей)',
    'Металлургические предприятия (49,1 млрд. рублей)',
    'другие отраслевые предприятия (26,9 млрд. рублей)',
  ],
};

export const mockHorzontalDataSix = {
  title: 'Фонд содействия инноваций: поддержка проектов цифровизации организаций ПК Красноярского края',
  graphic: [
    {
      name: 'Цифровые технологии',
      label: '5 проектов',
      uv: 15,
    },
    {
      name: 'Новые материалы',
      label: '7 проектов',
      uv: 57,
    },
    {
      name: 'Новые приборы и интеллектуальные производственные технологии',
      label: '10 проектов',
      uv: 8,
    },
    {
      name: 'Ресурсосберегающая энергетика',
      label: '1 проект',
      uv: 5,
    },
  ],
};

export const mockHorzontalDataSeven = {
  title:
    'Количество промышленных предприятий Красноярского края, зарегистрированных в Государственной информационной системе промышленности РФ, 2022',
  graphic: [
    {
      name: 'Количество промышленных предприятий Красноярского края в ГИСП',
      uv: 60,
    },
    {
      name: 'Объем отгруженной промышленной продукции предприятиями Красноярского края в ГИСП',
      uv: 78,
    },
  ],
};

export const mockHorzontalDataEight = {
  title: 'Степень автоматизации вспомогательных бизнес-процессов на предприятиях ПК, 2023 ',
  graphic: [
    {
      name: 'Управление финансами',
      uv: 3.8,
    },
    {
      name: 'Управление персоналом',
      uv: 3.5,
    },
    {
      name: 'Управление охраной труда, экологией и промышленной безопасности',
      uv: 3.4,
    },
    {
      name: 'Управление документооборотом и корпоративным контентом',
      uv: 3.3,
    },
    {
      name: 'Управление эксплуатации и обслуживанием оборудования',
      uv: 3.3,
    },
    {
      name: 'Управление ИТ',
      uv: 3.3,
    },
    {
      name: 'Организационное развитие и повышение операционной эффективности',
      uv: 3.0,
    },
    {
      name: 'Управление безопасности',
      uv: 3.0,
    },
    {
      name: 'Юридическое управление',
      uv: 3.0,
    },
    {
      name: 'Стратегическое управление предприятияем',
      uv: 2.8,
    },
  ],
};

export const mockHorzontalDataNine = {
  title:
    'Использование ключевых цифровых технологий организациями промышленности Красноярского края (проценты от количества организаций)',
  graphic: [
    {
      name: 'Операционные системы',
      uv: 19.2,
    },
    {
      name: 'Big Data',
      uv: 18.6,
    },
    {
      name: 'Цифровые платформы',
      uv: 14.9,
    },
    {
      name: 'Геоинформационные системы (ГИС)',
      uv: 13.6,
    },
    {
      name: 'Промышленный интернет-вещей (IoT)',
      uv: 10.6,
    },
    {
      name: 'RFID',
      uv: 9.2,
    },
    {
      name: 'Искусственный интеллект',
      uv: 3.5,
    },
    {
      name: 'Промышленные роботы',
      uv: 2.5,
    },
    {
      name: 'Аддитивные технологии',
      uv: 1.2,
    },
    {
      name: 'Цифровые двойники',
      uv: 1.0,
    },
  ],
};
