export const mockDataTable = [
  {
    name: 'Характеристика объекта',
    value: 'добыча нефти и конденсата до 3 млн. тонн в год добыча природного газа до 1,8 млрд м3 в год',
  },
  {
    name: 'Местоположение',
    value: 'Туруханский район',
  },
  {
    name: 'Зоны с особыми условиями использования территории',
    value: 'зона с особыми условиями использования территории определяется проектной документацией на объект',
  },
];

export const mockDataTablSecond = [
  {
    name: 'Характеристика объекта',
    value: `Строительство
        золотоизвлекательной фабрики на
        базе месторождения
        «Благодатное», технологическое
        усовершенствование
        горнодобывающего и
        перерабатывающего комплекса и
        внедрение технологии кучного
        выщелачивания`,
  },
  {
    name: 'Местоположение',
    value: 'Северо-Енисейский район',
  },
  {
    name: 'Зоны с особыми условиями использования территории',
    value: 'зона с особыми условиями использования территории определяется проектной документацией на объект',
  },
];
