export const mockDoubleHorizontalData = {
  title: 'Использование традиционных ИКТ организациями промышленности Красноярского края',
  graphic: [
    {
      name: 'Управление сбытом и логистикой',
      uv: 80.1,
      pv: 56.3,
    },
    {
      name: 'Электронный обмен данными с внешними информационными системами, государственной властью',
      uv: 50.5,
      pv: 46.2,
    },
    {
      name: 'Серверы, веб-сайты, Internet, аккаунты в социальных сетях, Extranet',
      uv: 44.0,
      pv: 20.7,
    },
    {
      name: 'Облачные сервисы',
      uv: 22.0,
      pv: 22.0,
    },
  ],
  legend: ['max', 'min'],
};

export const mockDoubleHorizontalDataSecond = {
  title: 'Уровни использование цифровых технологий предприятиями промышленности',
  graphic: [
    {
      name: 'Локальные вычислительные  сети',
      uv: 56.3,
      pv: 54.7,
      amt: 55.4,
    },
    {
      name: 'Геоинформационные системы (ГИС)',
      uv: 13.6,
      pv: 13.04,
      amt: 14.2,
    },
    {
      name: 'Цифровые платформы',
      uv: 14.6,
      pv: 17.2,
      amt: 17.5,
    },
    {
      name: 'Интернет-вещей (IoT)',
      uv: 10.6,
      pv: 13,
      amt: 11.5,
    },
    {
      name: 'Искусственный интеллект',
      uv: 3.5,
      pv: 5.4,
      amt: 4.3,
    },
    {
      name: 'Промышленные роботы',
      uv: 2.5,
      pv: 4.3,
      amt: 3,
    },
  ],
  legend: ['Красноярский край', 'РФ', 'СФО'],
};

export const mockDoubleHorizontalDataThrid = {
  title:
    'Уровень использования цифровых технологий в обрабатывающей промышленности Красноярского края (7 позиций, превышающие значения РФ) процент от количества организаций',
  graphic: [
    {
      name: 'Облачные сервисы',
      uv: 27.1,
      pv: 25.7,
    },
    {
      name: 'Big Data',
      uv: 26.5,
      pv: 22.4,
    },
    {
      name: 'Интернет-вещей (IoT)',
      uv: 15.8,
      pv: 13,
    },
    {
      name: 'RFID',
      uv: 16.5,
      pv: 10.8,
    },
    {
      name: 'Промышленные роботы',
      uv: 17.2,
      pv: 4.3,
    },
    {
      name: 'Аддитивные технологии',
      uv: 5.2,
      pv: 1.4,
    },
    {
      name: 'Цифровые двойники',
      uv: 3.3,
      pv: 1.1,
    },
  ],
  legend: ['Красноярский край', 'РФ'],
};
